OdDAI.DerivedAttribute.evaluate(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;!System.Runtime.CompilerServices.IsConst)
\details
Evaluates a nested expression and gets a calculated value.

OdDAI.DerivedAttribute.getAttributeType
\details
Retrieves the current attribute's tpye.
\returns An enum that contains the attribute's type.

OdDAI.DerivedAttribute.redeclaring
\details
Retrieves defenition of redeclared attribute.
\returns Returns a smart pointer to the container with defenition of redeclared attribute.